&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	Элементы.Товары.ТекущиеДанные.ЦенаПоступления = ОпределитьЦенаПоступления(Элементы.Товары.ТекущиеДанные.Номенклатура);
	Элементы.Товары.ТекущиеДанные.Стоимость =  Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаПоступления; 

КонецПроцедуры

&НаСервере
Функция ОпределитьЦенаПоступления(Номенклатура)
	
	Возврат Номенклатура.ЦенаПоступления;	

КонецФункции

&НаКлиенте
Процедура ТоварыЦенаПоступленияПриИзменении(Элемент)
	
	Элементы.Товары.ТекущиеДанные.Стоимость =  Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаПоступления; 

 КонецПроцедуры

&НаКлиенте
 Процедура ТоварыКоличествоТоваровПриИзменении(Элемент)
	 
	Элементы.Товары.ТекущиеДанные.Стоимость =  Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаПоступления;
	 
 КонецПроцедуры

