								 
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	Товар = Элементы.Товары.ТекущиеДанные;
 	Товар.ЦенаРеализации = ОпределитьЦенаРеализации(Товар.Номенклатура);

КонецПроцедуры

&НаСервере
Функция ОпределитьЦенаРеализации(Номенклатура)
	
	Возврат Номенклатура.ЦенаРеализации;	

КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	Элементы.Товары.ТекущиеДанные.Стоимость =  Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаРеализации;  
	
 КонецПроцедуры

&НаКлиенте
 Процедура ТоварыЦенаРеализацииПриИзменении(Элемент)
	 
	 Элементы.Товары.ТекущиеДанные.Стоимость =  Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.ЦенаРеализации;
	 
 КонецПроцедуры
